## Testing (Part 3 - addition of write-only attribute)

### Using as a new resource
```hcl
data "pipes_organization" "rr" {
  handle = "roadrunner"
}

resource "pipes_organization_connection" "gcp" {
  organization = data.pipes_organization.rr.handle
  handle = "gcp_connection"
  plugin = "gcp"

  config = jsonencode({
    project     = "does-this-need-to-work"
    ignore_error_codes = ["401", "403", "500"]
  })

  config_sensitive = jsonencode({
    credentials = var.gcp_creds
  })

}

variable "gcp_creds" {
  type = string
  sensitive = true
  default = "blah"
}
```

`tf apply`
```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 1s [id=o_d2k36ditjv1j579u5j0g]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pipes_organization_connection.gcp will be created
  + resource "pipes_organization_connection" "gcp" {
      + config                              = jsonencode(
            {
              + ignore_error_codes = [
                  + "401",
                  + "403",
                  + "500",
                ]
              + project            = "does-this-need-to-work"
            }
        )
      + config_sensitive                    = (write-only attribute)
      + config_source                       = (known after apply)
      + connection_id                       = (known after apply)
      + created_at                          = (known after apply)
      + created_by                          = (known after apply)
      + credential_source                   = (known after apply)
      + handle                              = "gcp_connection"
      + handle_dynamic                      = (known after apply)
      + handle_mode                         = (known after apply)
      + id                                  = (known after apply)
      + integration_resource_identifier     = (known after apply)
      + integration_resource_name           = (known after apply)
      + integration_resource_path           = (known after apply)
      + integration_resource_type           = (known after apply)
      + last_error_at                       = (known after apply)
      + last_error_process_id               = (known after apply)
      + last_successful_update_at           = (known after apply)
      + last_successful_update_process_id   = (known after apply)
      + last_update_attempted_at            = (known after apply)
      + last_update_attempted_at_process_id = (known after apply)
      + managed_by_id                       = (known after apply)
      + organization                        = "roadrunner"
      + organization_id                     = (known after apply)
      + parent_id                           = (known after apply)
      + plugin                              = "gcp"
      + plugin_version                      = (known after apply)
      + status                              = (known after apply)
      + tenant_id                           = (known after apply)
      + trunk                               = (known after apply)
      + type                                = (known after apply)
      + updated_at                          = (known after apply)
      + updated_by                          = (known after apply)
      + version_id                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pipes_organization_connection.gcp: Creating...
pipes_organization_connection.gcp: Creation complete after 0s [id=roadrunner/gcp_connection]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

`tf plan`
```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```

### Testing existing with credentials in config and migrating

`tf destroy`
```
...
pipes_organization_connection.gcp: Destroying... [id=roadrunner/gcp_connection]
pipes_organization_connection.gcp: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.
```

```hcl
data "pipes_organization" "rr" {
  handle = "roadrunner"
}

resource "pipes_organization_connection" "gcp" {
  organization = data.pipes_organization.rr.handle
  handle = "gcp_connection"
  plugin = "gcp"

  config = jsonencode({
    project     = "does-this-need-to-work"
    credentials = var.gcp_creds
    ignore_error_codes = ["401", "403", "500"]
  })
}

variable "gcp_creds" {
  type = string
  sensitive = true
  default = "blah"
}
```

`tf apply`
```
pipes_organization_connection.gcp: Creating...
pipes_organization_connection.gcp: Creation complete after 0s [id=roadrunner/gcp_connection]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

`tf plan`
```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # pipes_organization_connection.gcp will be updated in-place
  ~ resource "pipes_organization_connection" "gcp" {
      ~ config                          = (sensitive value)
        id                              = "roadrunner/gcp_connection"
        # (25 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

**Migration**
```hcl
data "pipes_organization" "rr" {
  handle = "roadrunner"
}

resource "pipes_organization_connection" "gcp" {
  organization = data.pipes_organization.rr.handle
  handle = "gcp_connection"
  plugin = "gcp"

  config = jsonencode({
    project     = "does-this-need-to-work"
    ignore_error_codes = ["401", "403", "500"]
  })

  config_sensitive = jsonencode({
    credentials = var.gcp_creds
  })
}

variable "gcp_creds" {
  type = string
  sensitive = true
  default = "blah"
}
```

`tf apply`
```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # pipes_organization_connection.gcp will be updated in-place
  ~ resource "pipes_organization_connection" "gcp" {
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ config                          = (sensitive value)
        id                              = "roadrunner/gcp_connection"
        # (25 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

pipes_organization_connection.gcp: Modifying... [id=roadrunner/gcp_connection]
pipes_organization_connection.gcp: Modifications complete after 0s [id=roadrunner/gcp_connection]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

`tf plan`
```
data.pipes_organization.rr: Reading...
data.pipes_organization.rr: Read complete after 0s [id=o_d2k36ditjv1j579u5j0g]
pipes_organization_connection.gcp: Refreshing state... [id=roadrunner/gcp_connection]

No changes. Your infrastructure matches the configuration.
```